![avatar](../../images/openGauss.png)

版权所有 © 2024  openGauss社区
 您对“本文档”的复制、使用、修改及分发受知识共享(Creative Commons)署名—相同方式共享4.0国际公共许可协议(以下简称“CC BY-SA 4.0”)的约束。为了方便用户理解，您可以通过访问[*https://creativecommons.org/licenses/by-sa/4.0/*](https://creativecommons.org/licenses/by-sa/4.0/) 了解CC BY-SA 4.0的概要 (但不是替代)。CC BY-SA 4.0的完整协议内容您可以访问如下网址获取：[*https://creativecommons.org/licenses/by-sa/4.0/legalcode*](https://creativecommons.org/licenses/by-sa/4.0/legalcode)。

修订记录

| 日期       | 修订版本 | 修改描述     | 作者   |
| ---------- | -------- | ------------ | ------ |
| 2026.05.14 | v1.0     | 测试报告初稿 | chen-czywj |



**Keywords 关键词**：全量迁移、数据一致性、数据完整性

**Abstract 摘要**：支持常用对象、数据类型迁移。包含：表、索引、约束、视图、触发器、函数、存储过程、类型、序列等。

**缩略语清单： **

| 缩略语 | 英文全名 | 中文解释 |
| ------ | -------- | -------- |
|        |          |          |

# 1 概述

本报告主要覆盖Oracle数据对象迁移到oGRAC数据库，主要包括：表、索引、约束、视图、触发器、函数、存储过程、类型、序列等。
不同数据类型迁移到oGRAC数据库，数据一致性、数据完整性验证。
分区表、主键表、表外键、表约束等复杂表结构迁移到oGRAC数据库，数据一致性、数据完整性验证。
简单视图、复杂视图、简单触发器、复杂触发器、简单函数、复杂函数简单存储过程、复杂存储过程等迁移到oGRAC数据库，数据一致性、数据完整性验证。
以及迁移工具易用性测试，包含参数配置、进度上报等功能测试，测试输出用例70个，发现问题14个，整体质量良好。

# 2 测试版本说明

## 2.1 测试版本信息

###   2.1.1 被测版本

| 版本名称                  | 软件包名称 | 测试起始时间 | 测试结束时间 | 测试人员 |
| ------------------------- | ---------- | ------------ | ------------ | -------- |
| openGauss 7.0.0-LTS(B003) | openGauss-FullReplicate-7.0.0-RC3.tar.gz  | 2026.04.23   | 2026.05.09   | chen-czywj  |

###  2.1.2 配套测试的版本

| 版本名称 | 软件包名称 | 版本说明 |
| -------- | -------- | -------- |
| openGauss 7.0.0-LTS(B003) | oGRAC  |  迁移目标端数据库信息 |
| 19c | Oracle  |  迁移源端数据库版本信息 |

## 2.2 测试环境描述

###  2.2.1 环境硬件信息

| 环境信息 | 硬件配置信息                                                 | 备注 |
| -------- | ------------------------------------------------------------ | ---- |
| 物理机   | Kunpeng-920 OS：openEuler release 20.03(LTS) |      |

# 3 版本概要测试结论、关键风险和规避措施

## 3.1 测试结论总结

本报告主要覆盖Oracle数据对象迁移到oGRAC数据库，主要包括：表、索引、约束、视图、触发器、函数、存储过程、类型、序列等。
不同数据类型迁移到oGRAC数据库，数据一致性、数据完整性验证。
分区表、主键表、表外键、表约束等复杂表结构迁移到oGRAC数据库，数据一致性、数据完整性验证。
简单视图、复杂视图、简单触发器、复杂触发器、简单函数、复杂函数简单存储过程、复杂存储过程等迁移到oGRAC数据库，数据一致性、数据完整性验证。
以及迁移工具易用性测试，包含参数配置、进度上报等功能测试；测试源端数据迁移到目标端性能测试，性能满足迁移指标300M/s。测试输出用例70个，发现问题14个，整体质量良好。

## 3.2 约束说明

## 3.3 关键风险和规避措施

无

# 4 版本详细测试结论

## 4.1 特性测试结论

###   4.1.1 新需求质量评价

| 特性              | 特性价值评估          | 应用说明及关键约束假设依赖 | 关键遗留事项如缺陷等 | 测试整体覆盖情况                     | 特性质量评估               | 主要风险 |
|-----------------|-----------------| -------------------------- | -------------------- | ------------------------------------ | -------------------------- | -------- |
| Oracle2oGRAC | 该特性实现将oracle库中数据对象迁入ograc中，方便用户进行数据库系统升级或数据库平替 |             |                      | 主要覆盖功能测试 | <font color=green>▮</font> | 无       |

*特性质量评估说明*：

<font color=red><font color=red>●</font></font>： *表示特性不稳定，风险高*

<font color=yellow><font color=yellow>▲</font></font>： *表示特性基本可用，遗留少量问题*

<font color=green>▮</font>： *表示特性质量良好*

## 4.2 产品功能属性测试结论

| 测试点 | 功能点验证                                                   | 是否覆盖 |
| -------- | ------------------------------------------------------------ | -------- |
| 数据类型 | 字符数据类型：覆盖数据类型极值范围数据迁移、中英文数据迁移等 | YES      |
|  | 数字类型：覆盖不同数据类型存储最值迁移，精度范围迁移。FLOAT类型数据迁移可能存在精度问题，导致迁移报错，具体可查询特性资料说明 | YES      |
|  | 日期、时间类型：date类型、TIMESTAMP相关类型、间隔时间等迁移正常、TIMESTAMP类型在oGRAC中精度最大不能超过6，所以可能存在精度问题导致迁移报错，具体可查询特性资料说明 | YES      |
|  | 二进制类型：RAW(size)、LONG RAW、BLOB​ | YES      |
|  | 其他类型：ROWID、BOOLEAN，其中BOOLEAN类型oracle实现是char(1)类型实现 | YES      |
| 表 | 主键表、分区表、外键、检查约束、唯一约束、表、字段备注、字段默认值 | YES |
| 序列 | 基本序列、带缓存序列、带循环序列、带最大值不循环 | YES |
| 索引 | 单一索引：B-tree Index、 UNIQUE INDEX、 Bitmap Index、Reverse Key Index、Function-based Index等迁移覆盖 | YES |
|  | 复合索引、多索引迁移​ | YES      |
| 视图 | 简单视图、复杂视图包含连接&聚合等、物化视图​。 | YES      |
| 存储过程| 简单存储过程、带in参数、带out参数、带游标、复杂逻辑等 | YES |
| 函数| 简单函数、带out参数、自定义聚合函数、复杂包含业务逻辑等 | YES |
| 触发器| insert触发器、update触发器、delete触发器、instead of触发器、复合触发器等 | YES |
| 迁移工具参数校验| 参数校验、参数默认值、参数异常值等 | YES |
| 迁移工具进度上报 | 涉及isDumpJson、statusDir，进度上报内容测试 | YES |

## 4.3 产品质量属性目标(DFX)测试结论

###  4.3.1 性能测试结论

性能指标：300M/s

测试模型：Oracle20张表，每张表数据100万条数据

https://gitcode.com/opengauss/debezium/tree/master/migration-tool-test/oracle_test_scenario/general_data 

测试环境资源

源端数据库环境资源 CPU：384核，内存：755G

目标端数据库环境资源 CPU：96核，内存：1021G

测试工具环境资源 CPU：96核，内存：755G

| 测试步骤                  | 测试结果 |
| ------------------------- | -------- |
| 源端数据库生成数据完成后，启动迁移工具记录启动时间、记录迁移工具执行结束时间  | 性能：326M/s     |
|  源端数据与目标端数据验证 |   数据一致   |


###  4.3.2 可靠性测试结论

| 测试步骤                               | 测试结果 |
| -------------------------------------- | -------- |
|   |   |

###  4.3.3 安全&隐私保护测试结论

| 测试步骤 | 测试结果 |
| -------- | -------- |
|          |          |

### 4.3.4 可服务性测试结论

| 测试步骤 | 测试结果 |
| -------- | -------- |
|          |          |

### 4.3.5 生命周期管理测试结论

| 测试步骤 | 测试结果 |
| -------- | -------- |
|          |          |

### 4.3.6 韧性测试结论

| 测试步骤 | 测试结果 |
| -------- | -------- |
|          |          |

###  4.3.7 兼容性测试结论

| 测试步骤 | 测试结果 |
| -------- | -------- |
|          |          |

###  4.3.8 升级测试结论

| 测试步骤 | 升级路径 | 测试结果 |
| -------- | -------- | -------- |
|          |          |          |

## 4.4 资料测试结论

| 序号 | 测试章节          | 测试结论 |
| ---- | ----------------- | -------- |
|   1   | oracle2ograc-readme.md  |  描述正确、工具使用指导正确 |

# 5 测试对象质量评估

##  5.1 覆盖率分析

##  5.2 缺陷统计和分析

###   5.2.1 缺陷统计

|        | 问题总数 | 严重 | 主要 | 次要 | 不重要 |
| ------ | -------- | ---- | ---- | ---- | ------ |
| 数目   | 14       | 0    | 1    | 13   | 0      |
| 百分比 | 100%       | 0%   | 7%   | 93% | 0%     |

###   5.2.2 缺陷列表

| 问题单号 | 问题描述 | 问题级别 | 当前状态 |
| -------- | -------- | -------- | -------- |
| [270](https://gitcode.com/opengauss/debezium/issues/270) | 【Oracle2oGRAC迁移工具包解压后缺失可执行jar | 主要     | 已验收   |
| [271](https://gitcode.com/opengauss/debezium/issues/271) | 【测试类型：功能测试】【Oracle2oGRAC】非主键表迁移报错，数据不能迁移 | 次要    | 已验收   |
| [272](https://gitcode.com/opengauss/debezium/issues/272) | [Bug]: 【测试类型：功能测试】【Oracle2oGRAC】字符类型中文数据迁移到oGRAC侧，数据为乱码 | 次要    | 已验收   |
| [273](https://gitcode.com/opengauss/debezium/issues/273) | [Bug]: 【测试类型：功能测试】【Oracle2oGRAC】迁移数据迁移工具报错，数据未迁移 | 次要    | 已验收   |
| [274](https://gitcode.com/opengauss/debezium/issues/274) | [Bug]: 【测试类型：功能测试】【Oracle2oGRAC】NUMBER类型迁移丢失精度，导致数据迁移丢失数据 | 次要    | 已验收   |
| [275](https://gitcode.com/opengauss/debezium/issues/275) | [Bug]: 【测试类型：资料测试】【oracle2ograc-readme.md】浮点类型迁移映射错误，浮点数精度问题需文档说明 | 次要    | 已验收   |
| [276](https://gitcode.com/opengauss/debezium/issues/276) | [Bug]: 【测试类型：功能测试】【Oracle2oGRAC】时间类型迁移，精度大于3，迁移后数据小数位被截断 | 次要    | 已验收   |
| [277](https://gitcode.com/opengauss/debezium/issues/277) | [Bug]: 【测试类型：功能测试】【Oracle2oGRAC】SEQUENCE迁移报错 | 次要    | 已验收   |
| [278](https://gitcode.com/opengauss/debezium/issues/278) | [Bug]: 【测试类型：功能测试】【Oracle2oGRAC】分区表指定分区迁移完成后，目标端分区错误 | 次要    | 已验收   |
| [279](https://gitcode.com/opengauss/debezium/issues/279) | [Bug]: 【测试类型：功能测试】【Oracle2oGRAC】复合外键迁移报错 | 次要    | 已验收   |
| [280](https://gitcode.com/opengauss/debezium/issues/280) | [Bug]: 【测试类型：功能测试】【Oracle2oGRAC】Bitmap Index迁移映射为B-tree Index迁移报错 | 次要    | 已验收   |
| [281](https://gitcode.com/opengauss/debezium/issues/281) | [Bug]: 【测试类型：功能测试】【Oracle2oGRAC】复合索引单键指定排序方式，迁移完成后丢失未指定键 | 次要    | 已验收   |
| [282](https://gitcode.com/opengauss/debezium/issues/282) | [Bug]: 【测试类型：功能测试】【Oracle2oGRAC】视图迁移报错invalid word 'WITH' found | 次要    | 已验收   |
| [283](https://gitcode.com/opengauss/debezium/issues/283) | [Bug]: 【测试类型：功能测试】【Oracle2oGRAC】存储过程迁移报错 | 次要    | 已验收   |


# 6 测试过程评估

##  6.1 测试策略回顾

| 编号 | 特性       | 验证策略                                                     | 是否按照测试策略执行 |
| ---- | ---------- | ------------------------------------------------------------ | -------------------- |
|
|1| 数据类型迁移 | 字符数据类型：覆盖数据类型极值范围数据迁移、中英文数据迁移等 | YES      |
||  | 数字类型：覆盖不同数据类型存储最值迁移，精度范围迁移。FLOAT类型数据迁移可能存在精度问题，导致迁移报错，具体可查询特性资料说明 | YES      |
||  | 日期、时间类型：date类型、TIMESTAMP相关类型、间隔时间等迁移正常、TIMESTAMP类型在oGRAC中精度最大不能超过6，所以可能存在精度问题导致迁移报错，具体可查询特性资料说明 | YES      |
||  | 二进制类型：RAW(size)、LONG RAW、BLOB​ | YES      |
||  | 其他类型：ROWID、BOOLEAN，其中BOOLEAN类型oracle实现是char(1)类型实现 | YES      |
|2| 表迁移 | 主键表、分区表、外键、检查约束、唯一约束、表、字段备注、字段默认值 | YES |
|3| 序列迁移 | 基本序列、带缓存序列、带循环序列、带最大值不循环 | YES |
|4| 索引迁移 | 单一索引：B-tree Index、 UNIQUE INDEX、 Bitmap Index、Reverse Key Index、|YES|Function-based Index等迁移覆盖 | YES |
||  | 复合索引、多索引迁移​ | YES      |
|5| 视图 | 简单视图、复杂视图包含连接&聚合等、物化视图​。 | YES      |
|6| 存储过程| 简单存储过程、带in参数、带out参数、带游标、复杂逻辑等 | YES |
|7| 函数| 简单函数、带out参数、自定义聚合函数、复杂包含业务逻辑等 | YES |
|8| 触发器| insert触发器、update触发器、delete触发器、instead of触发器、复合触发器等 | YES |
|9| 迁移工具参数校验| 参数校验、参数默认值、参数异常值等 | YES |
|10| 迁移工具进度上报 | 涉及isDumpJson、statusDir，进度上报内容测试 | YES |
|11| 迁移性能测试 | 源端20张，每张表100万条记录，迁移到目标端用时计算迁移速度满足300M/s | YES |




##  6.2 测试设计评估

| 编号 | 测试点修改说明 | 修改原因 | 是否影响测试质量 |
| ---- | -------------- | -------- | ---------------- |
| NA   |                |          |                  |

##  6.3 测试执行评估

###  6.3.1 测试执行统计数据

| 版本名称                 | 工作量投入(人天) | 测试用例数 | 用例执行数 | 发现缺陷数 | 代码量(K) | 缺陷密度(KLOC) |
| ------------------------ | ---------------- | ---------- | ---------- | ---------- | -------------- | --- |
| openGauss 7.0.0-LTS B003 |  15               | 70         | 70         | 13          |    9.2     | 1.41 |

*说明：发现问题14个，其中issue：275为文档类型问题，不纳入缺陷统计。*

###  6.3.2 测试用例执行结果统计数据

| 计划测试用例数 | 实际测试的用例数 | Passed | Failed | Blocked | Unavailable | 执行率 | 执行通过率 |
| -------------- | ---------------- | ------ | ------ | ------- | ----------- | ------ | ---------- |
| 70             | 70               | 40     |   7    | 23       | 0           | 100%   | 57%       |

# 7 附件

##  7.1 附件1：遗留问题列表



##  7.2 附件2：特性相关PR

1、源代码PR & 文档pr

https://gitcode.com/opengauss/debezium/pull/415

https://gitcode.com/opengauss/debezium/pull/414

https://gitcode.com/opengauss/debezium/pull/411

https://gitcode.com/opengauss/debezium/pull/409

https://gitcode.com/opengauss/debezium/pull/408


3、测试设计：

https://devcloud.cn-east-3.huaweicloud.com/testmind/project/03669bfd256c444bbfda6d7fb8b83bb2/testmind/mindmap?mindId=cbc55a9931b943aa8a29972367845eca

4、测试用例：

测试用例->openGauss_7.0.0LTS->工具链->Oracle2oGRAC